; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star6 - direction
	Star9 - direction
	Star10 - direction
	GroundStation13 - direction
	GroundStation14 - direction
	Star11 - direction
	GroundStation7 - direction
	Star4 - direction
	GroundStation12 - direction
	Star8 - direction
	Star5 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet21)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Planet15)
	(have_image Star16 spectrograph1)
	(have_image Planet17 spectrograph1)
	(have_image Planet18 infrared0)
	(have_image Planet19 infrared0)
	(have_image Phenomenon20 spectrograph1)
	(have_image Planet21 infrared0)
))

)

; plan
1. (turn_to satellite0 star11 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star11)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star11)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet18 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet18)
   goals met: 0 of 7
5. (take_image satellite0 planet18 instrument0 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 1 of 7
6. (turn_to satellite0 planet17 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet17)
   goals met: 1 of 7
7. (take_image satellite0 planet17 instrument0 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon20 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon20)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon20 instrument0 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 3 of 7
10. (turn_to satellite0 planet19 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 planet19)
   goals met: 3 of 7
11. (take_image satellite0 planet19 instrument0 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 4 of 7
12. (turn_to satellite0 planet21 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet21)
   goals met: 4 of 7
13. (take_image satellite0 planet21 instrument0 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 5 of 7
14. (turn_to satellite0 star16 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star16)
   goals met: 5 of 7
15. (take_image satellite0 star16 instrument0 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 6 of 7
16. (turn_to satellite0 planet15 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet15)
   goals met: 7 of 7
